docs/Design Patterns/system-arch.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-10-18 Mon 18:39 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>System Architectures System Architectures</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="/static/css/org.css">
</head>
<body>
<div id="preamble" class="status">
<a href="/">Home</a>
</div>
<div id="content">
<header>
<h1 class="title">System Architectures System Architectures</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfd47690">1. Software Architecture Patterns</a>
<ul>
<li><a href="#org71da862">1.1. Event Driven</a></li>
<li><a href="#org66276c1">1.2. Microkernal</a></li>
<li><a href="#orgf197238">1.3. IOT</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-orgfd47690" class="outline-2">
<h2 id="orgfd47690"><span class="section-number-2">1</span> Software Architecture Patterns</h2>
<div class="outline-text-2" id="text-1">
<p>
Patterns around designing and implementing applications for resuse.
</p>
</div>

<div id="outline-container-org71da862" class="outline-3">
<h3 id="org71da862"><span class="section-number-3">1.1</span> Event Driven</h3>
</div>
<div id="outline-container-org66276c1" class="outline-3">
<h3 id="org66276c1"><span class="section-number-3">1.2</span> Microkernal</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Plugin based system with a single core and public API. Much like Eclipse structure. The plugins can communicate with each other.
</p>
</div>
</div>

<div id="outline-container-orgf197238" class="outline-3">
<h3 id="orgf197238"><span class="section-number-3">1.3</span> IOT</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><a href="https://www.losant.com/blog/the-architecture-of-an-iot-platform-data-storage">The Architecture of an IoT Platform - Data Storage</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-10-18 Mon 18:39</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
